alacritty
alfred
amethyst
docker
font-cascadia-code
font-courier-new
font-courier-prime
font-courier-prime-code
font-fantasque-sans-mono-noloopk
font-input
font-hack
font-recursive
font-verdana
google-chrome
kitty
ngrok
sequel-pro
slack
thunderbird
tunnelblick
