#!/usr/bin/env ruby

brew "antigen"
brew "aspell"
brew "bash"
brew "cmake"
brew "coreutils"
brew "curl"
brew "dockutil"
brew "eslint"
brew "fd"
brew "fzf"
brew "git"
brew "gnupg"
brew "go"
brew "htop"
brew "isync"
brew "jq"
brew "lua"
brew "make"
brew "msmtp"
brew "nmap"
brew "notmuch"
brew "nvm"
brew "openssl"
brew "pass"
brew "python@3.9"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "stow"
brew "swaks"
brew "tmux"
brew "wget"
brew "yarn"
brew "zsh"

# Taps

tap "smallwat3r/scripts"
brew "shhh"
brew "sketch"
brew "synonym"
brew "tubestatus"

tap "teamookla/speedtest"
brew "speedtest"

tap "heroku/brew"
brew "heroku"

tap "homebrew/cask-fonts"
brew "font-fantasque-sans-mono-noloopk"

tap "johanhaleby/kubetail"
brew "kubetail"

# Casks

cask_args appdir: '/Applications'

cask "alacritty"
cask "alfred"
cask "bitwarden"
cask "docker"
cask "google-chrome"
cask "icanhazshortcut"
cask "keybase"
cask "nordvpn"
cask "signal"
cask "slack"
cask "tunnelblick"

tap "homebrew/cask-versions"
cask 'sequel-pro-nightly'
