; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! exec-path-from-shell)
(package! mini-modeline)
(package! kubernetes)
(package! kubernetes-evil)
(package! jinja2-mode)
(package! dired-narrow)
(package! deadgrep)
(package! evil-surround)
(package! info-colors)
(package! modus-vivendi-theme)
